Revit 2020 API
Field.CompatibleDisplayUnitType Method
 Checks if the specified type is compatible with the field description.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2012
Syntax
C#
public bool CompatibleDisplayUnitType(
	DisplayUnitType type
)
Visual Basic
Public Function CompatibleDisplayUnitType ( _
	type As DisplayUnitType _
) As Boolean
Visual C++
public:
bool CompatibleDisplayUnitType(
	DisplayUnitType type
)
Parameters
type
Type: Autodesk.Revit.DB.DisplayUnitType
 The type to check.
Return Value
 True if the type is compatible, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace